CHO = (
    'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ',
    'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
)

JUNG = (
    'ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ',
    'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'
)

JONG = (
    '', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ', 'ㄺ',
    'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ',
    'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
)

FIRST_HANGUL_UNICODE = 0xAC00  # '가'
LAST_HANGUL_UNICODE = 0xD7A3  # '힣'
DEFAULT_COMPOSE_CODE = 'ᴥ'

# EOJEOL_TYPO = {'완전':'오나전', '뭘': '무러', '했는데':'햇는ㄷ', '처럼':'철머'}
TYPO = {
    'ㄱ' : ['ㅅ', 'ㄷ', 'ㄹ'], 'ㄲ' : ['ㄱ', 'ㅅ', 'ㅆ'], 'ㅂ' : ['ㅈ', 'ㅁ'], 'ㅃ' : ['ㅂ', 'ㅈ', 'ㅉ', 'ㅁ'], 'ㅈ' : ['ㅂ', 'ㄷ'], 'ㅉ' : ['ㅈ', 'ㅃ', 'ㄷ', 'ㄸ', 'ㅂ', 'ㄴ'],
    'ㄷ' : ['ㅈ', 'ㄱ'], 'ㄸ' : ['ㄷ', 'ㄱ', 'ㄲ'], 'ㅅ': ['ㄱ', 'ㅎ'], 'ㅆ' : ['ㅅ', 'ㄱ', 'ㄲ', 'ㅎ'],
    'ㅁ' : ['ㅂ','ㄴ','ㅋ'], 'ㄴ' : ['ㅈ', 'ㅁ', 'ㅇ'], 'ㅇ' : ['ㄷ', 'ㄹ', 'ㄴ'], 'ㄹ' : ['ㅎ', 'ㄱ'], 'ㅎ' : ['ㄹ'],
    'ㅋ' : ['ㅁ', 'ㅌ'], 'ㅌ' : ['ㅋ', 'ㅇ', 'ㅊ'], 'ㅊ' : ['ㅍ', 'ㅌ', 'ㅇ'], 'ㅍ' : ['ㅠ', 'ㅊ', 'ㅎ'],
    'ㅛ' : ['ㅕ', 'ㅗ'], 'ㅕ' : ['ㅛ', 'ㅑ', 'ㅓ'], 'ㅑ' : ['ㅕ', 'ㅐ', 'ㅏ'], 'ㅐ' : ['ㅑ', 'ㅔ', 'ㅒ'], 'ㅒ' : ['ㅐ', 'ㅖ', 'ㅔ'], 'ㅔ' : ['ㅖ', 'ㅐ', 'ㅒ'], 'ㅖ' : ['ㅔ', 'ㅖ', 'ㅐ'],
    'ㅗ' : ['ㅓ', 'ㅛ', 'ㅜ'], 'ㅓ' : ['ㅕ', 'ㅗ', 'ㅏ'], 'ㅏ' : ['ㅓ', 'ㅑ', 'ㅣ'], 'ㅣ' : [ 'ㅏ'], 'ㅠ' : ['ㅜ'], 'ㅜ' : ['ㅠ', 'ㅡ'], 'ㅡ' : ['ㅜ'],
    'ㄳ' : ['ㄱ', 'ㅅ'], 'ㄵ' : ['ㄴ', 'ㅈ'], 'ㄶ' : ['ㄴ', 'ㅎ'], 'ㄺ' : ['ㄹ', 'ㄱ'], 'ㄻ' : ['ㄹ', 'ㅁ'], 'ㄼ' : ['ㄹ', 'ㅂ'],
    'ㄽ' : ['ㄹ', 'ㅅ'], 'ㄾ' : ['ㄹ', 'ㅌ'], 'ㄿ' : ['ㄹ', 'ㅍ'], 'ㅀ' : ['ㄹ', 'ㅎ'], 'ㅄ' : ['ㅂ', 'ㅅ'],
    'ㅘ' : ['ㅗ', 'ㅏ'], 'ㅙ' : ['ㅗ', 'ㅐ', 'ㅚ'], 'ㅚ' : ['ㅗ', 'ㅣ', 'ㅙ'], 'ㅝ' : [ 'ㅜ', 'ㅓ'], 'ㅞ' : ['ㅜ', 'ㅔ'], 'ㅟ' : ['ㅜ', 'ㅣ'], 'ㅢ' : ['ㅡ', 'ㅣ'],
        }

ssang_jaeum = ('ㄲ', 'ㄸ', 'ㅃ', 'ㅆ', 'ㅉ')

ggub_jong = {'ㄳ' : ('ㄱ', 'ㅅ'), 'ㄵ' : ('ㄴ', 'ㅈ'), 'ㄶ' : ('ㄴ', 'ㅎ'), 'ㄺ' : ('ㄹ', 'ㄱ'), 'ㄻ' : ('ㄹ', 'ㅁ'), 'ㄼ' : ('ㄹ', 'ㅂ'),
             'ㄽ' : ('ㄹ', 'ㅅ'), 'ㄾ' : ('ㄹ', 'ㅌ'), 'ㄿ' : ('ㄹ', 'ㅍ'), 'ㅀ' : ('ㄹ', 'ㅎ'), 'ㅄ' : ('ㅂ', 'ㅅ')}

ggub_jung = { 'ㅘ' : ('ㅗ', 'ㅏ'), 'ㅙ' : ('ㅗ', 'ㅐ'), 'ㅚ' : ('ㅗ', 'ㅣ'), 'ㅝ' : ('ㅜ', 'ㅓ'), 'ㅞ' : ('ㅜ', 'ㅔ'), 'ㅟ' : ('ㅜ', 'ㅣ'), 'ㅢ' : ('ㅡ', 'ㅣ')}

reversed_ggub_jong = dict(map(reversed, ggub_jong.items()))

reversed_ggub_jung = dict(map(reversed, ggub_jung.items()))

